Revit 2027 API
ProjectLocation.IsProjectLocationNameUnique Method
 Verifies that there is no existing ProjectLocation with the given name belonging to the given SiteLocation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsProjectLocationNameUnique(
	Document document,
	string name,
	ElementId siteLocationId
)
Public Shared Function IsProjectLocationNameUnique (
	document As Document,
	name As String,
	siteLocationId As ElementId
) As Boolean
public:
static bool IsProjectLocationNameUnique(
	Document^ document,
	String^ name,
	ElementId^ siteLocationId
)
static member IsProjectLocationNameUnique :
        document : Document *
        name : string *
        siteLocationId : ElementId -> bool
Parameters
document Document
 The document to check.
name String
 The name to check.
siteLocationId ElementId
 The ElementId of the SiteLocation which the ProjectLocation belongs to.
Return Value
Boolean
 True if the name is unused (among ProjectLocations). False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ProjectLocation Class
Autodesk.Revit.DB Namespace